{"singlePage": [], "startSite": "03/08/2025", "filingNum": "", "onePageListNum": 20, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "style": "", "head": "", "indexScript": "", "indexStyle": "", "bottomText": "", "showPostSource": 1, "iconList": {"about": "M10.561 8.073a6.005 6.005 0 0 1 3.432 5.142.75.75 0 1 1-1.498.07 4.5 4.5 0 0 0-8.99 0 .75.75 0 0 1-1.498-.07 6.004 6.004 0 0 1 3.431-5.142 3.999 3.999 0 1 1 5.123 0ZM10.5 5a2.5 2.5 0 1 0-5 0 2.5 2.5 0 0 0 5 0Z", "主页": "M14.25 1c.966 0 1.75.784 1.75 1.75v7.5A1.75 1.75 0 0 1 14.25 12h-3.727c.099 1.041.52 1.872 1.292 2.757A.752.752 0 0 1 11.25 16h-6.5a.75.75 0 0 1-.565-1.243c.772-.885 1.192-1.716 1.292-2.757H1.75A1.75 1.75 0 0 1 0 10.25v-7.5C0 1.784.784 1 1.75 1ZM1.75 2.5a.25.25 0 0 0-.25.25v7.5c0 .138.112.25.25.25h12.5a.25.25 0 0 0 .25-.25v-7.5a.25.25 0 0 0-.25-.25ZM9.018 12H6.982a5.72 5.72 0 0 1-.765 2.5h3.566a5.72 5.72 0 0 1-.765-2.5Z"}, "UTC": 8, "rssSplit": "sentence", "exlink": {"about": "https://www.czyouge.xyz/about/", "主页": "https://www.czyouge.xyz/"}, "needComment": 1, "allHead": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekVercount.js'></script><script async src='https://www.googletagmanager.com/gtag/js?id=G-0Z3PHKTB0H'></script><script>window.dataLayer=window.dataLayer||[];function gtag(){dataLayer.push(arguments);}gtag('js',new Date());gtag('config','G-0Z3PHKTB0H');</script>", "title": "虫子游戈", "homeUrl": "https://blog.czyouge.xyz", "subTitle": "Since 2025", "avatarUrl": "https://www.czyouge.xyz/blog/avatar.png", "GMEEK_VERSION": "last", "postListJson": {"P2": {"htmlDir": "docs/post/gu-shi.html", "labels": ["杂谈"], "postTitle": "故事", "postUrl": "post/gu-shi.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/2", "commentNum": 0, "wordCount": 19, "description": "AI 时代，人类所能拥有的，唯有故事。", "top": 0, "createdAt": 1742948455, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-03-26", "dateLabelColor": "#0969da"}, "P3": {"htmlDir": "docs/post/zhong-ying-hun-pai-gong-ju.html", "labels": ["技术"], "postTitle": "中英混排工具", "postUrl": "post/zhong-ying-hun-pai-gong-ju.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/3", "commentNum": 0, "wordCount": 4981, "description": "我的日常工作经常需要中英混排工具来对文本内容进行格式化处理，之前常用的是在线的[独特工具箱](https://www.dute.org/type-setting)。", "top": 0, "createdAt": 1745671756, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-04-26", "dateLabelColor": "#0969da"}, "P4": {"htmlDir": "docs/post/ru-he-zai-shou-ji-shang-ben-di-yun-xing-LLM.html", "labels": ["技术"], "postTitle": "如何在手机上本地运行LLM", "postUrl": "post/ru-he-zai-shou-ji-shang-ben-di-yun-xing-LLM.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/4", "commentNum": 0, "wordCount": 979, "description": "> 基本无用的技能又增加了。", "top": 0, "createdAt": 1746973585, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-05-11", "dateLabelColor": "#0969da"}, "P5": {"htmlDir": "docs/post/wei-Gmeek-bo-ke-zheng-he-Google Analytics.html", "labels": ["技术"], "postTitle": "为Gmeek博客整合Google Analytics", "postUrl": "post/wei-Gmeek-bo-ke-zheng-he-Google%20Analytics.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/5", "commentNum": 0, "wordCount": 679, "description": "想为 [Gmeek](https://meekdai.com/Gmeek.html) 博客整合 Google Analytics？\n\n方法很简单。", "top": 0, "createdAt": 1747315777, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-05-15", "dateLabelColor": "#0969da"}, "P6": {"htmlDir": "docs/post/ru-guo-AI-neng-xue-hui-yi-qie-，-wo-you-shen-me-yi-yi-？.html", "labels": ["杂谈"], "postTitle": "如果AI能学会一切，我有什么意义？", "postUrl": "post/ru-guo-AI-neng-xue-hui-yi-qie-%EF%BC%8C-wo-you-shen-me-yi-yi-%EF%BC%9F.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/6", "commentNum": 0, "wordCount": 941, "description": "最近这些年，人工智能（AI）发展得太快了，也夺走了一些工作岗位。", "top": 0, "createdAt": 1747828882, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-05-21", "dateLabelColor": "#0969da"}, "P7": {"htmlDir": "docs/post/AI-hui-meng-jian-guo-qu-ma-？-jie-mi-da-mo-xing-de-ji-yi-jin-hua-zhi-lu.html", "labels": ["技术"], "postTitle": "AI会梦见过去吗？解密大模型的记忆进化之路", "postUrl": "post/AI-hui-meng-jian-guo-qu-ma-%EF%BC%9F-jie-mi-da-mo-xing-de-ji-yi-jin-hua-zhi-lu.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/7", "commentNum": 0, "wordCount": 15260, "description": "**转载自机器之心《[那天，AI大模型想起了，被「失忆」所束缚的枷锁](https://mp.weixin.qq.com/s/N_iEDFATkdbazXyjzUF2wA)》。", "top": 0, "createdAt": 1756815765, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-09-02", "dateLabelColor": "#0969da"}, "P8": {"htmlDir": "docs/post/1 Million Citation! How Yoshua Bengio Defined an Era of AI.html", "labels": ["AI"], "postTitle": "1 Million Citation! How Yoshua Bengio Defined an Era of AI", "postUrl": "post/1%20Million%20Citation%21%20How%20Yoshua%20Bengio%20Defined%20an%20Era%20of%20AI.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/8", "commentNum": 0, "wordCount": 18260, "description": "Computer scientist Yoshua Bengio has made history, becoming the first scientist to surpass 1 million citations on Google Scholar.\n\n![](https://i.imgur.com/OoYo71p.png)\n\nTo put that number in perspective: If we printed each citing paper (assuming an average 1 mm thickness) and stacked them, the resulting tower of knowledge would stand 1,000 meters tall. That easily eclipses the world's current tallest building, the 828-meter Burj Khalifa.\n\nOf course, great minds often travel in packs. In this intellectual feat, Bengio is not alone. His friends and fellow 'Godfathers of Deep Learning,' Geoffrey Hinton and Yann LeCun, also boast astonishing citation counts of over 970,000 and 430,000, respectively.\n\n![](https://i.imgur.com/WUSDxzC.jpeg)\n\nAs the first scientist to top one million citations, Yoshua Bengio's citation growth curve almost perfectly maps to AI's explosive journey from the margins to the center of the world.\n\n![](https://i.imgur.com/ixOyDmJ.png)\n\nIt's important to emphasize **scientist** because Bengio is not the first _person_ to hit this milestone. The French philosopher and historian of ideas, [Michel Foucault](https://scholar.google.com/citations?user=AKqYlxMAAAAJ&hl=en), has an astonishing 1.39 million citations on Google Scholar.\n\nThis 1 million-citation milestone, therefore, is more than just recognition for a single scientist. It is a monument to the spectacular two-decade journey of AI, from theoretical concept to a reality that is changing the world.\n\n![](https://i.imgur.com/K8vwID3.png)\n\n## The Pioneer of Deep Learning and the 'Conscience' of AI\n\nIn the brilliant constellation of artificial intelligence (AI), few names shine like Yoshua Bengio's, representing both pioneering technical breakthroughs and a profound sense of social responsibility. He, along with Geoffrey Hinton and Yann LeCun, is known as one of the 'Three Godfathers of Deep Learning,' jointly winning the highest honor in computer science: the Turing Award.\n\nHowever, this gentle, soft-spoken scientist, even as he helped usher the world into a new age of AI, has increasingly become one of the field's most prominent 'whistleblowers.' His life story is one of academic perseverance through the 'AI Winter' and an intellectual quest to help steer humanity's future on the crest of a technological wave.\n\n## From Sci-Fi Youth to Academic Star\n\nBorn in Paris, France, on March 5, 1964, to a Jewish family that had immigrated from Morocco, Yoshua Bengio grew up in an environment filled with art and intellect. His father, Carlo Bengio, was a pharmacist and a playwright who ran a Sephardic Jewish theater troupe in Montreal that performed in Judeo-Arabic. His mother, Célia Moreno, had been a prominent figure in Moroccan theater before co-founding a multimedia theater troupe in Montreal. This cross-cultural, artistic background may have planted the seeds of free-thinking and innovation in Bengio's mind early on.\n\nWhen Bengio was 12, his family moved to Montreal, Canada.\n\nBy then, he was already immersed in the science fiction worlds of Asimov, Ray Bradbury, and Arthur C. Clarke. He was deeply fascinated by Stanley Kubrick's _2001: A Space Odyssey_, particularly the relationship between man and machine and the idea of 'a teacher teaching a machine about the world, day after day.' 'Science fiction is a way of dreaming about the future,' Bengio later recalled.\n\nFrom the age of 11, he began programming on a calculator, his interest in mathematics and computer science growing daily. He admitted to having a poor memory and not being good at rote memorization, which paradoxically drew him to math and computer science, fields that required only reasoning.\n\nWith his family's encouragement, Yoshua Bengio's talents flourished. He and his younger brother Samy Bengio (who would also become a distinguished AI scientist at Google Brain, one of the three authors of Torch, and is now a Senior Director of AI and Machine Learning Research at Apple) were nearly inseparable, studying and exchanging ideas.\n\n![](https://i.imgur.com/VLUG4EM.png)\n\n*The Bengio brothers: Samy Bengio (left) and Yoshua Bengio (right)*\n\nIn 1986, Yoshua Bengio entered McGill University, where he earned a bachelor's degree in electrical engineering, followed by a master's and Ph.D. in computer science, laying a solid foundation for his future academic career.\n\nAfter graduating with his Ph.D. in 1991, he held postdoctoral positions at MIT and the renowned AT&T Bell Labs, studying under giants like Michael I. Jordan. In 1993, he returned to Montreal and officially joined the faculty of the Université de Montréal, beginning an academic career that would have a profound impact.\n\n## Perseverance Through the 'AI Winter'\n\nIn the late 1980s and 1990s, when Bengio dedicated himself to neural network research, the field was enduring a long 'AI Winter.'\n\nAt the time, the mainstream academic community was skeptical of the utility of neural networks, often dismissing them as 'alchemy' with no practical application. Research funding was scarce. Many researchers shifted to other, seemingly more promising, fields.\n\nYet Bengio, along with his peers Hinton and LeCun, chose to persevere. He was captivated by Hinton's vision of building an 'intelligent computer' based on neural networks. 'It wasn't just math or computer science,' Bengio said. 'It was about understanding intelligence in humans and, therefore, building intelligent machines.' This grand vision sustained him through the adversity. He later reflected, 'I think I was perhaps insensitive to what people cared about at a particular time. I just believed in what I was doing.'\n\n![](https://i.imgur.com/pHspFAI.png)\n\nIt was this 'insensitivity' and persistence that led Bengio to a series of foundational breakthroughs over the next two decades:\n\n- **Backpropagation and Recurrent Neural Networks (RNN)**: In the 90s, he delved into backpropagation algorithms and, in 1997, with collaborators, introduced the Long Short-Term Memory (LSTM) network, greatly enhancing the ability of neural networks to process sequential data and laying the groundwork for the later revolution in natural language processing.\n- **Neural Probabilistic Language Models:** In 2003, he published the landmark paper 'A Neural Probabilistic Language Model.' This model introduced the concept of 'word embeddings,' representing words as continuous vectors, which effectively overcame the 'curse of dimensionality' in NLP. It is a direct ancestor of modern language models like BERT and GPT.\n- **Training Deep Architectures:** His 2009 paper, '[Learning Deep Architectures for AI](https://www.iro.umontreal.ca/~lisa/pointeurs/TR1312.pdf),' systematically articulated the theory, challenges, and solutions for deep learning, especially techniques like unsupervised pre-training. This paved the way for training deeper, more complex networks, significantly pushing deep learning from theory to practice.\n- **Generative Adversarial Networks (GANs):** In 2014, the GANs he proposed with Ian Goodfellow and others opened up a vital branch of generative AI. By having two neural networks compete against each other, they could generate new, hyper-realistic data, creating a profound impact in fields like image generation and artistic creation.\n\nThese studies, which seemed marginal at the time, eventually converged into a powerful torrent that completely changed the face of AI, transforming Bengio from an obscure explorer into a top global academic superstar.\n\n## Building an AI Hub in Montreal\n\nDespite his rising fame, Bengio deliberately kept his distance from Silicon Valley's celebrity culture. When Hinton and LeCun joined Google and Facebook, respectively, he chose to stay in Montreal, focusing on a more purely academic life. 'I don't like this personalization of science, where you turn some scientists into stars,' said the self-described introvert.\n\nHe poured his energy into founding the Montreal Institute for Learning Algorithms (MILA). His vision was to create an open, collaborative center connecting academia and industry, attracting top global talent.\n\nUnder his leadership, MILA quickly grew into one of the world's leading AI research institutions, successfully transforming Montreal into a global AI hub on par with Silicon Valley and London.\n\nIn the eyes of his colleagues, Bengio is an unconventional thinker who champions freedom. He dislikes hierarchy and has even shared the proceeds from his own projects with junior colleagues. His philosophy echoes the 1968 Paris student slogan: 'Il est interdit d'interdire!' (It is forbidden to forbid! ) This spirit was also embodied in Element AI, the AI incubator he co-founded, which was dedicated to translating cutting-edge research into practical business applications.\n\n## Becoming the 'Conscience' of the AI Age\n\nAs the AI technology he helped create began to permeate every aspect of society at an unprecedented speed, Bengio's conscience underwent a profound shift. He grew increasingly worried that these powerful tools, if they fell into the 'wrong hands,' could lead to a dark future or even create real-world 'killer robots.'\n\nIn a May 2023 interview with the BBC, he confessed to feeling 'lost' about his life's work, seeing the risk of AI technology being misused growing day by day. This anxiety transformed him from a pure scientist into an active social advocate and ethicist.\n\nHe pins his hopes on a _Star Trek_ future, not a _Terminator_ one. 'In _Star Trek_, you have a democratic government, everybody has good medical care, education, and food, and there are no wars except against aliens,' Bengio said. 'I’m also trying to combine the science with... how to improve society.'\n\nHis concerns are not just talk; they have translated into a series of concrete actions:\n\n- **Promoting Ethical Guidelines:** He helped draft the '[The Montréal Declaration for a Responsible Development of Artificial Intelligence](https://montrealdeclaration-responsibleai.com/the-declaration/),' advocating for transparent, fair, and interpretable AI.\n- **Calling for International Regulation:** He has openly supported international treaties to ban the development and use of 'lethal autonomous weapons' (killer robots).\n- **Signing Open Letters:** After the release of GPT-4, he co-signed the Future of Life Institute's open letter calling for a at least a six-month pause on training AI systems more powerful than GPT-4, giving society time to assess risks and establish guardrails.\n- **Leading International Safety Reports:** He was commissioned by the UK Prime Minister to lead an international scientific report on the safety of advanced AI, assessing risks such as cyberattacks and 'loss of control.'\n- **Founding a Non-Profit:** He launched LawZero, a non-profit organization aimed at building 'honest' AI systems capable of detecting and stopping harmful behaviors by autonomous agents.\n\nDespite this, Bengio is not a pessimistic technophobe. He finds the 'Terminator scenario'—imagining machines will betray humanity due to emotions and self-esteem—to be 'ridiculous.' He emphasizes that the real risk is not machine 'awakening,' but human misuse and improper control of powerful tools. 'You cannot blame the inventor of algebra for the fact that it’s being used to compute missile trajectories,' he says, 'but we need to act wisely.'\n\n## Bengio's Most-Cited Papers\n\nAccording to Google Scholar, Yoshua Bengio has 19 papers or works with over 10,000 citations, and 96 with over 1,000. Among these, two have surpassed 100,000 citations each—together, they account for more than a fifth of his current million citations.\n\nThe most cited is the eponymous paper '[Generative Adversarial Nets](https://arxiv.org/abs/1406.2661),' which he co-authored with Ian Goodfellow and others.\n\n![](https://i.imgur.com/gsCwPi9.png)\n\nThis paper introduced the famous Generative Adversarial Networks (GANs). Its core adversarial training technique and unique architecture, consisting of a Generator and a Discriminator, demonstrated enormous potential in generating high-quality data samples.\n\nSpecifically, the framework trains two neural networks—a generative model (G) and a discriminative model (D)—by having them play against each other. G's task is to learn the true data distribution to generate samples realistic enough to fool D (like a counterfeiter), while D's task is to distinguish real data from G's fake data (like a cop). This adversarial process forms a 'minimax two-player game,' and the entire system can be trained end-to-end using backpropagation, successfully avoiding reliance on Markov chains or complex probability calculations found in many traditional generative models. The paper highlights this adversarial architecture and demonstrated its feasibility and potential on datasets like MNIST and CIFAR-10.\n\nClose behind is '[Deep learning](https://www.nature.com/articles/nature14539),' co-authored with Geoffrey Hinton and Yann LeCun.\n\n![](https://i.imgur.com/4izBD7x.png)\n\nThis is a foundational review paper that explains the basic concepts, core techniques, and primary architectures of deep learning and its immense impact across multiple fields.\n\nSpecifically, deep learning constructs multi-layered computational models that allow machines to automatically learn representations of data with multiple levels of abstraction. The method uses the backpropagation algorithm to adjust the model's internal parameters, successfully overcoming the limitations of traditional machine learning, which relied on hand-crafted features. The paper highlights key architectures: Convolutional Neural Networks (CNNs), which achieved revolutionary breakthroughs in image processing, and Recurrent Neural Networks (RNNs), which excel at processing sequential data like text and speech. The article concludes that deep learning has achieved great success in many areas and looks forward to its future progress in unsupervised learning and integration with reinforcement learning.\n\nInterestingly, Bengio's third most-cited work is also titled 'Deep Learning,' but it is the classic textbook he co-authored with Ian Goodfellow and Aaron Courville—it has already garnered over 86k citations!\n\n![](https://i.imgur.com/4ntZ5mK.jpeg)\n\nThe image below details his 19 publications with over 10,000 citations.\n\n![](https://i.imgur.com/8N0RVkv.png)\n\n## Bengio Is Still Pushing Forward\n\nNotably, at 61, Yoshua Bengio remains prolific, continuing to publish papers and research reports as the first author.\n\nFor example, this past September, he and his student Eric Elmoznino published '[Illusions of AI consciousness](https://www.science.org/doi/10.1126/science.adn4935)' in _Science_, exploring two major questions:\n\n- As AI continues to improve, how will scientific and public beliefs about AI consciousness evolve?\n- What are the risks if we begin to treat future AI as conscious beings? For instance, if an AI disobeys a human command, would shutting it down have legal constraints, given it's viewed as a living entity?\n\nThis October, he was again the first author on an AI safety report, '[International AI Safety Report 2025: First Key Update: Capabilities and Risk Implications](https://arxiv.org/abs/2510.13653),' which re-evaluates AI safety based on extensive new evidence.\n\n![](https://i.imgur.com/3Se7a22.png)\n\n*Bengio's foreword to the report*\n\nMeanwhile, new papers bearing Yoshua Bengio's name appear in a constant stream. In these, his name often appears last in the author list. In academia, this typically signifies his role as the project's supervisor, the lab's principal investigator, providing direction, resources, and final oversight for the explorations of young researchers. This reflects another of his immense contributions: mentoring the next generation of top talent.\n\n![](https://i.imgur.com/H6mBLDL.png)\n\n*A recent paper with Yoshua Bengio's name on it (arXiv:2510.09660)*\n\n## Humility and Vision at the Pinnacle of Science\n\nIn 2018, Bengio stood on the podium with Hinton and LeCun to accept the Turing Award.\n\n![](https://i.imgur.com/97q3Xft.png)\n\nThis is just one of Yoshua Bengio's many honors. He has also received the Order of Canada, been elected a Fellow of the Royal Society, received the French Legion of Honour, and was named one of [_Time_ magazine's 100 most influential people](https://time.com/collections/time100-ai-2025/7305845/yoshua-bengio-ai/).\n\nYet, facing this tide of accolades, Bengio maintains a scientist's humility and clarity. Unmoved by fame or fortune, in his spare time, he enjoys reading Spinoza or walking in the woods near his home. He treats his students like family and enjoys spending time with them. He knows well that the enemies of scientific progress are complacency and overconfidence. 'Confidence is not enough,' he has said. 'You can be confident and wrong.'\n\nToday, Yoshua Bengio's legacy is twofold. On one hand, he is a founder of deep learning; his theories and algorithms form the bedrock of modern AI and have profoundly changed our world. On the other hand, he is becoming one of the most important voices on technology ethics of our time, guiding a global discussion on the future direction of AI with the rigor of a scientist and the compassion of a humanist.\n\nHis life story tells us that the greatest scientists not only explore unknown frontiers but also hold a sense of awe for their own creations and bravely shoulder the responsibility of shaping the future. At this crossroads for AI, filled with infinite possibilities and potential risks, Bengio is working to ensure that we choose the path toward a brighter, safer future that serves human well-being.\n\nThat 1 million citations records a brilliant past; his current advocacy and urgent calls are shaping the next million, and the future far beyond.\n\n---\n\n**Reference Links**\n\n1. https://scholar.google.com/citations?hl=en&user=kukA0LcAAAAJ\n2. https://hai.stanford.edu/people/yoshua-bengio\n3. https://time.com/collections/time100-ai-2025/7305845/yoshua-bengio-ai/\n4. https://quantumzeitgeist.com/yoshua-bengio/\n5. https://awards.acm.org/award_winners/bengio_3406375\n6. https://www.exponentialview.co/p/yoshua-bengio-towards-ais-humanistic\n7. https://ciela.science/team/yoshua-bengio/\n8. https://yoshuabengio.org/profile/\n。", "top": 0, "createdAt": 1761822402, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-10-30", "dateLabelColor": "#0969da"}, "P9": {"htmlDir": "docs/post/uv-de-yi-xie-ji-ben-yong-fa.html", "labels": ["技术"], "postTitle": "uv的一些基本用法", "postUrl": "post/uv-de-yi-xie-ji-ben-yong-fa.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/9", "commentNum": 0, "wordCount": 862, "description": "为了解决项目之间的依赖冲突，使用以下命令创建虚拟环境：\n\n```\npython -m venv .venv\n```\n\n但 uv 更方便，只需这样就能初始化：\n\n```\nuv init\n```\n\n使用 pyproject.toml 文件来管理配置文件。", "top": 0, "createdAt": 1762334479, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-11-05", "dateLabelColor": "#0969da"}, "P10": {"htmlDir": "docs/post/Notepad++-shi-xian-zheng-ze-biao-da-shi-cha-zhao-bing-ti-huan.html", "labels": ["技术"], "postTitle": "Notepad++实现正则表达式查找并替换", "postUrl": "post/Notepad%2B%2B-shi-xian-zheng-ze-biao-da-shi-cha-zhao-bing-ti-huan.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/10", "commentNum": 0, "wordCount": 724, "description": "Notepad++ 的宏功能很强大，但很多时候，光是录制宏并不够用。", "top": 0, "createdAt": 1762336196, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-11-05", "dateLabelColor": "#0969da"}, "P11": {"htmlDir": "docs/post/Notepad++-zhong-ying-hun-pai-de-huan-xing-wen-ti.html", "labels": ["技术"], "postTitle": "Notepad++中英混排的换行问题", "postUrl": "post/Notepad%2B%2B-zhong-ying-hun-pai-de-huan-xing-wen-ti.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/11", "commentNum": 0, "wordCount": 1063, "description": "Notepad++ 是我日常工作的重要利器。", "top": 0, "createdAt": 1762940483, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-11-12", "dateLabelColor": "#0969da"}, "P12": {"htmlDir": "docs/post/huan-xing.html", "labels": ["故事"], "postTitle": "唤醒", "postUrl": "post/huan-xing.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/12", "commentNum": 0, "wordCount": 6502, "description": "**特别声明：本故事由虫子游戈与 Gemini 2.5 Pro 合作完成。", "top": 0, "createdAt": 1763285148, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-11-16", "dateLabelColor": "#0969da"}, "P13": {"htmlDir": "docs/post/Obsidian Full Calendar But Better.html", "labels": ["技术"], "postTitle": "Obsidian Full Calendar But Better", "postUrl": "post/Obsidian%20Full%20Calendar%20But%20Better.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/13", "commentNum": 0, "wordCount": 436, "description": "[Full Calendar](https://github.com/liamcain/obsidian-calendar-plugin) 是一个很不错的 Obsidian 插件，但缺点也很明显：\n\n- 三年未更新了。", "top": 0, "createdAt": 1764322327, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-11-28", "dateLabelColor": "#0969da"}, "P14": {"htmlDir": "docs/post/ge-ming-de-nai-shui.html", "labels": ["故事"], "postTitle": "革命的奶水", "postUrl": "post/ge-ming-de-nai-shui.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/14", "commentNum": 0, "wordCount": 3944, "description": "**特别声明：本故事由虫子游戈与 Gemini 3.0 Pro 合作完成。", "top": 0, "createdAt": 1764597837, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script><script>MathJax = {tex: {inlineMath: [[\"$\", \"$\"]]}};</script><script async src=\"https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js\"></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-12-01", "dateLabelColor": "#0969da"}, "P15": {"htmlDir": "docs/post/guo-nian.html", "labels": ["故事"], "postTitle": "过年", "postUrl": "post/guo-nian.html", "postSourceUrl": "https://github.com/czyouge/blog/issues/15", "commentNum": 0, "wordCount": 1738, "description": "**特别声明：本故事由虫子游戈与 ChatGPT 合作完成。", "top": 0, "createdAt": 1764679656, "style": "", "script": "<script src='https://blog.meekdai.com/Gmeek/plugins/GmeekTOC.js'></script>", "head": "", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "createdDate": "2025-12-02", "dateLabelColor": "#0969da"}}, "singeListJson": {}, "labelColorDict": {"about": "#aaaaaa", "AI": "#41a7d7", "技术": "#231120", "故事": "#FBCA04", "杂谈": "#0e8a16"}, "displayTitle": "虫子游戈", "faviconUrl": "https://www.czyouge.xyz/blog/avatar.png", "ogImage": "https://www.czyouge.xyz/blog/avatar.png", "primerCSS": "<link href='https://mirrors.sustech.edu.cn/cdnjs/ajax/libs/Primer/21.0.7/primer.css' rel='stylesheet' />", "prevUrl": "disabled", "nextUrl": "disabled"}